---
kind: method
id: M:Autodesk.Revit.DB.FailureDefinitionId.op_Inequality(Autodesk.Revit.DB.FailureDefinitionId,Autodesk.Revit.DB.FailureDefinitionId)
source: html/2c1212ac-b498-db33-a5f2-e9eccd71cdc8.htm
---
# Autodesk.Revit.DB.FailureDefinitionId.op_Inequality Method

Compares two FailureDefinitionId instances.

## Syntax (C#)
```csharp
public static bool operator !=(
	FailureDefinitionId first,
	FailureDefinitionId second
)
```

## Parameters
- **first** (`Autodesk.Revit.DB.FailureDefinitionId`) - The first FailureDefinitionId.
- **second** (`Autodesk.Revit.DB.FailureDefinitionId`) - The second FailureDefinitionId.

## Returns
True if the inputs are different, false if they are identical.